#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
data.azurerm_client_config.current: Reading...
module.resource_group.azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae]
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD03ZWM4YjkyZi02NzEyLTRkZDUtOTBiYy1iNmY2NGNjY2ZjMGU7b2JqZWN0SWQ9ZDA1ODQyNGEtYjdjOC00Y2JmLTljYzktNmUwODkxNzAzNTdjO3N1YnNjcmlwdGlvbklkPTc3MzQ4ZTZjLTAyODYtNDk2Zi04MzM2LTI4ZTk2NmIxMzY0ODt0ZW5hbnRJZD1lNjBiYjc2Yy04ZmRhLTRlZDQtYTM1NC00ODM2ZTNiZmNiYzM=]
module.vnet.azurerm_virtual_network.vnet: Refreshing state... [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.Network/virtualNetworks/vnet-biotrackr-prod-ae]
module.law.azurerm_log_analytics_workspace.law: Refreshing state... [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.OperationalInsights/workspaces/law-biotrackr-prod-ae]
module.aca_subnet.azurerm_subnet.subnet: Refreshing state... [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.Network/virtualNetworks/vnet-biotrackr-prod-ae/subnets/infrastructure-subnet]
module.ai.azurerm_application_insights.ai: Refreshing state... [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.Insights/components/ai-biotrackr-prod-ae]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.aca_env.azurerm_container_app_environment.env will be created
  + resource "azurerm_container_app_environment" "env" {
      + custom_domain_verification_id               = (known after apply)
      + dapr_application_insights_connection_string = (sensitive value)
      + default_domain                              = (known after apply)
      + docker_bridge_cidr                          = (known after apply)
      + id                                          = (known after apply)
      + infrastructure_subnet_id                    = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.Network/virtualNetworks/vnet-biotrackr-prod-ae/subnets/infrastructure-subnet"
      + internal_load_balancer_enabled              = false
      + location                                    = "australiaeast"
      + log_analytics_workspace_id                  = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.OperationalInsights/workspaces/law-biotrackr-prod-ae"
      + mutual_tls_enabled                          = false
      + name                                        = "env-biotrackr-prod-ae"
      + platform_reserved_cidr                      = (known after apply)
      + platform_reserved_dns_ip_address            = (known after apply)
      + resource_group_name                         = "rg-biotrackr-prod-ae"
      + static_ip_address                           = (known after apply)
      + tags                                        = {
          + "Application" = "biotrackr"
          + "Component"   = "Core-Infra"
          + "environment" = "Production"
          + "owner"       = "willvelida"
        }
      + zone_redundancy_enabled                     = true
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: main.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "main.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

*Pushed by: @willvelida, Action: `pull_request`*